{
    "title": "Blueberry Sour Raspberry Elf Bar Elfa Pro Prefilled Pods",
    "handle": "blueberry-sour-raspberry-elf-bar-elfa-pro-prefilled-pods",
    "vendor": "Elf Bar",
    "product_type": "Vape Pods",
    "tags": [
        "1200 puffs",
        "20mg",
        "Berries",
        "Blueberry",
        "closed pods",
        "Pre-Filled Pods",
        "Raspberry",
        "Sour",
        "Vape Pods"
    ],
    "price": "4.95",
    "description": "Blueberry Sour Raspberry Elfa Pro Prefilled Pod by Elf Bar presents a tantalising blend of sweet blueberries and tangy sour raspberries. Experience the harmonious fusion of fruity flavours that delivers a delightful balance of sweetness and sourness. Elfa Pro Prefilled Pods have been exclusively designed with the Elfa Pro pod vape kit. Containing 2ml of e-liquid, each pod delivers up to 600 puffs, similar to disposable vapes . Infused with nic salts, they guarantee a smooth throat hit and rapidly reduce cravings. With these convenient prefilled pods, there's no need for refills or coil replacements. Once depleted, they can be easily disposed of. Each pod houses a QUAQ tech coil, boasting an ultra-fine mesh and absorbent wick, resulting in enhanced flavour. Drawing inspiration from the trendy blends of Elf Bar disposable vapes, Elfa Pro pod flavours offer a wide selection. This cost-effective pack of two pods are an excellent choice: they're as convenient as a disposable vape but at a significantly reduced price. Elf Bar is a reputable brand known for its exceptional disposable vapes and flavorful e-liquids. Their commitment to quality makes them a popular choice among vapers worldwide. ELF Bar ELFA Pro Pods Features: Flavour Profile: Blueberry, Raspberry 20mg Nicotine Salt Suitable for MTL Vapes Wide range of flavours Inspired by the World’s Leading Disposable Vape",
    "created_at": "2023-08-31T17:28:14+01:00",
    "updated_at": "2024-10-18T03:32:23+01:00",
    "variants": [
        {
            "id": 43211111006377,
            "product_id": 7781589057705,
            "title": "Default Title",
            "price": "4.95",
            "sku": "EBELFAPROBLSR",
            "position": 1,
            "inventory_policy": "deny",
            "compare_at_price": "5.95",
            "fulfillment_service": "manual",
            "inventory_management": "shopify",
            "option1": "Default Title",
            "option2": null,
            "option3": null,
            "created_at": "2023-08-31T17:28:14+01:00",
            "updated_at": "2024-10-18T03:32:23+01:00",
            "taxable": true,
            "barcode": null,
            "grams": 35,
            "image_id": null,
            "weight": 0.035,
            "weight_unit": "kg",
            "inventory_quantity": 4,
            "old_inventory_quantity": 4,
            "requires_shipping": true,
            "quantity_rule": {
                "min": 1,
                "max": null,
                "increment": 1
            },
            "price_currency": "GBP",
            "compare_at_price_currency": "GBP",
            "quantity_price_breaks": []
        }
    ],
    "images": [
        {
            "src": "https://cdn.shopify.com/s/files/1/0241/2241/files/Elf-Bar-Elfa-Pro-Prefilled-Pods-Blueberry-Sour-Raspberry.jpg?v=1707889885",
            "alt": "Blueberry Sour Raspberry elf bar elfa pro pre filled pods",
            "width": 1200,
            "height": 1200
        }
    ],
    "weight": 0.035,
    "inventory_quantity": 4,
    "compare_at_price": "5.95"
}