{
    "title": "Apple Lemon Pear Cake Mafia Nicotine Pouches by KURWA",
    "handle": "apple-lemon-pear-cake-mafia-nicotine-pouches-by-kurwa",
    "vendor": "KURWA",
    "product_type": "Nicotine Pouches UK",
    "tags": [
        "flavour-apple",
        "flavour-cake",
        "flavour-cheesecake",
        "flavour-lemon",
        "flavour-lemon-lime",
        "flavour-main-fruity",
        "flavour-main-sweets",
        "KURWA",
        "Mix-&-Match",
        "nicotine-products",
        "nicotine-warnings",
        "Pearls",
        "sale",
        "SKIP_AV",
        "strength-19mg",
        "strong"
    ],
    "price": "3.99",
    "description": "TRY KURWA APPLE LEMON PEAR CAKE MAFIA NICOTINE POUCHES The delectable combination of dessert-inspired flavours in the Apple Lemon Pear Cake Mafia Nicotine Pouches by Kurwa will take you to the centre of a pastry kitchen. This unusual mixture combines the juicy juiciness of pears, the crisp sweetness of apples, the zesty tang of lemons, and the warm comfort of cake to create a flavour experience that is both luxurious and fulfilling. KEY FEATURES: Dessert flavoured nicotine pouches 19.2MG Strong pouches Perfect option for those looking to quit smoking Effective nicotine absorption Tobacco-free, smoke-free and vapour-free Suitable for all environments. MORE ABOUT APPLE LEMON PEAR CAKE FLAVOURED NICOTINE POUCHES Prepare to be amazed by the exquisite quartet of flavours that erupts on your taste in the dessert extravaganza. Each pouch captures the flavour of apples sweet and crisp lemons, citrusy lemon, zest juiciness, and cake comforting warmth. The end product is a flavorful concoction with dessert-inspired undertones that evokes indulgence and contentment. MORE ABOUT KURWA MAFIA NICOTINE POUCHES The Mafia Range offers a variety of enticing flavours to suit a variety of palates. There is a flavour to suit every palate, from fruity combinations that are fun to bubblegum's whimsical sweetness and the exciting flavours of the tropics. Additional Description Information: Brand Name: KURWA Product Type: Nicotine Pouches Pouch Format: Slim Our Strength Rating: Strong Nicotine per Pouch (mg/pouch) 19.2 MG Flavour Name: Apple Lemon Pear Cake Flavour: Dessert Pouches per can: 20 Shipping from: London, UK",
    "created_at": "2023-09-07T14:18:31+01:00",
    "updated_at": "2024-10-18T03:32:14+01:00",
    "variants": [
        {
            "id": 44334174961890,
            "product_id": 8148626211042,
            "title": "Strong (19.2MG)",
            "price": "3.99",
            "sku": "KURWA-APPLE-LEMON-PEAR-CAKE",
            "position": 1,
            "compare_at_price": "4.99",
            "fulfillment_service": "manual",
            "inventory_management": "shopify",
            "option1": "Strong (19.2MG)",
            "option2": null,
            "option3": null,
            "created_at": "2023-09-07T14:18:32+01:00",
            "updated_at": "2024-10-18T03:32:17+01:00",
            "taxable": true,
            "barcode": "",
            "grams": 45,
            "image_id": null,
            "weight": 45.0,
            "weight_unit": "g",
            "requires_shipping": true,
            "price_currency": "GBP",
            "compare_at_price_currency": "GBP"
        }
    ],
    "images": [
        {
            "src": "https://cdn.shopify.com/s/files/1/0521/8965/9295/files/Apple_Lemon_Pear_Cake_Mafia_Nicotine_Pouches_by_KURWA_19mg.jpg?v=1694703362",
            "alt": "Apple Lemon Pear Cake Mafia Nicotine Pouches by KURWA 19mg",
            "width": 800,
            "height": 800
        }
    ],
    "weight": 45.0,
    "inventory_quantity": null,
    "compare_at_price": "4.99"
}