{
    "title": "Peach & Mint Nicotine Pouches By 77",
    "handle": "peach-mint-nicotine-pouches-by-77",
    "vendor": "77",
    "product_type": "Nicotine Pouches UK",
    "tags": [
        "77",
        "extra-strong",
        "flavour-main-drinks",
        "flavour-main-fruity",
        "flavour-main-menthol",
        "flavour-main-sweets",
        "flavour-mint",
        "flavour-peach",
        "flavour-peppermint",
        "Mix-&-Match",
        "nicotine-products",
        "nicotine-warnings",
        "SKIP_AV",
        "strength-13mg",
        "strength-20mg",
        "strong"
    ],
    "price": "3.99",
    "description": "TRY 77 PEACH & MINT NICOTINE POUCHES Peach & Mint nicotine pouches by 77 is a delicious nicotine pouch that combines a cooling and fresh mint with wonderfully sweet and luscious peach. The cooling effect of mint along with the sweet taste of the peaches are perfect for a summer’s day. View all 77 Pouches View all Fruity Pouches View all Mint/Menthol Pouches View all Extra Strong Pouches KEY FEATURES: 20MG Per Gram | 13MG Per Pouch Peach & Mint flavoured nicotine pouches Recommended for experienced users Tobacco-free, smoke-free and vapour-free 20 pouches in each can MORE ABOUT PEACH FLAVOURED NICOTINE POUCHES Peach has been a popular flavour for quite a while, and the taste of peach-flavoured products is getting closer and closer to the true taste of a fresh peach. Peach, along with ginseng and lemon, are among the most popular flavours rising on the European market, not matter if it is in flavoured water, candy, tea, or nicotine pouches. So, if you are looking for a flavour of the future; peach is the option for you. MORE ABOUT 77 NICOTINE POUCHES 77 were the first polish brand of tobacco-free nicotine pouches. 77 offers one of the most diverse ranges of flavour on the market, 77 also hit the sweet spot with their nicotine levels. Switch up, switch down, mix and match – do whatever suits you best! Flavours range from different types of mint to peach, apple, strawberries, and even classic tobacco. Additional Description Information: Brand Name: 77Pouches Product Type: Nicotine Pouches Pouch Format: Large Our Strength Rating: Extra Strong Nicotine per Gram 20 MG Nicotine per Pouch 13 MG Flavour Name: Peach & Mint Flavour: Fruity Pouches per can: 20 Shipping from: London, UK",
    "created_at": "2022-09-27T21:32:27+01:00",
    "updated_at": "2024-10-18T03:07:27+01:00",
    "variants": [
        {
            "id": 43438507491554,
            "product_id": 7897293488354,
            "title": "Default Title",
            "price": "3.99",
            "sku": "77-PEACH-MINT",
            "position": 1,
            "compare_at_price": "5.49",
            "fulfillment_service": "manual",
            "inventory_management": "shopify",
            "option1": "Default Title",
            "option2": null,
            "option3": null,
            "created_at": "2022-09-27T21:32:27+01:00",
            "updated_at": "2024-10-18T03:07:30+01:00",
            "taxable": true,
            "barcode": "",
            "grams": 45,
            "image_id": null,
            "weight": 45.0,
            "weight_unit": "g",
            "requires_shipping": true,
            "price_currency": "GBP",
            "compare_at_price_currency": "GBP"
        }
    ],
    "images": [
        {
            "src": "https://cdn.shopify.com/s/files/1/0521/8965/9295/files/Peach_Mint_Nicotine_Pouches_By_77_20MG.jpg?v=1701182661",
            "alt": "Peach & Mint Nicotine Pouches By 77 20MG",
            "width": 800,
            "height": 800
        }
    ],
    "weight": 45.0,
    "inventory_quantity": null,
    "compare_at_price": "5.49"
}